### Terraform Plan - `k8s-cluster` - Development 🪐
- Terraform Format and Style 🖌: `failure`
- Terraform Initialization ⚙️: `success`
- Terraform Validation 🤖: `success`
- Terraform Plan 📖: `success`

<details><summary><b>Show Plan</b></summary>

```terraform
azurerm_resource_group.default: Refreshing state... [id=/subscriptions/2a951275-83dd-49a2-abd2-195c4345cce1/resourceGroups/feyrek8s-dev-rg]
azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/2a951275-83dd-49a2-abd2-195c4345cce1/resourceGroups/feyrek8s-dev-rg/providers/Microsoft.ContainerRegistry/registries/feyrek8sacrdev]
azurerm_kubernetes_cluster.default: Refreshing state... [id=/subscriptions/2a951275-83dd-49a2-abd2-195c4345cce1/resourcegroups/feyrek8s-dev-rg/providers/Microsoft.ContainerService/managedClusters/feyrek8s-dev-aks]
azurerm_role_assignment.acrpull_role: Refreshing state... [id=/subscriptions/2a951275-83dd-49a2-abd2-195c4345cce1/resourceGroups/feyrek8s-dev-rg/providers/Microsoft.ContainerRegistry/registries/feyrek8sacrdev/providers/Microsoft.Authorization/roleAssignments/263ffe01-8371-b224-18ba-70ffdf2ac621]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

</details>

> Pusher: @GrantBirki, Action: `pull_request`, Working Directory: `terraform/k8s-cluster`, Workflow: `deployment`

### Terraform Plan - `k8s` - Development 🪐
- Terraform Format and Style 🖌: `failure`
- Terraform Initialization ⚙️: `success`
- Terraform Validation 🤖: `success`
- Terraform Plan 📖: `success`

<details><summary><b>Show Plan</b></summary>

```terraform
module.frontend.kubectl_manifest.frontend_namespace[0]: Refreshing state... [id=/api/v1/namespaces/frontend]
module.backend.kubectl_manifest.backend_namespace[0]: Refreshing state... [id=/api/v1/namespaces/backend]
module.backend.kubectl_manifest.backend_deployment[0]: Refreshing state... [id=/apis/apps/v1/namespaces/backend/deployments/backend]
module.backend.kubectl_manifest.backend_service[0]: Refreshing state... [id=/api/v1/namespaces/backend/services/backend]
module.frontend.kubectl_manifest.frontend_secret[0]: Refreshing state... [id=/api/v1/namespaces/frontend/secrets/frontend-secret]
module.frontend.kubectl_manifest.frontend_deployment[0]: Refreshing state... [id=/apis/apps/v1/namespaces/frontend/deployments/frontend]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.backend.kubectl_manifest.backend_deployment[0] has been changed
  ~ resource "kubectl_manifest" "backend_deployment" {
        id                      = "/apis/apps/v1/namespaces/backend/deployments/backend"
      ~ live_resource_version   = "121211" -> "122863"
        name                    = "backend"
        # (14 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.frontend.kubectl_manifest.frontend_deployment[0] is tainted, so must be replaced
-/+ resource "kubectl_manifest" "frontend_deployment" {
      ~ id                      = "/apis/apps/v1/namespaces/frontend/deployments/frontend" -> (known after apply)
      ~ live_manifest_incluster = (sensitive value)
      ~ live_resource_version   = "5282" -> (known after apply)
      ~ live_uid                = "2de8a596-76cb-4bcb-b607-f25facc0faac" -> (known after apply)
        name                    = "frontend"
      ~ resource_version        = "5198" -> (known after apply)
      ~ uid                     = "2de8a596-76cb-4bcb-b607-f25facc0faac" -> (known after apply)
      ~ yaml_incluster          = (sensitive value)
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

> Pusher: @GrantBirki, Action: `pull_request`, Working Directory: `terraform/k8s`, Workflow: `deployment`